<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c8bd50e1092370758b645c026c860c87affbe4375cff400243cec2d3c338b672","plan_job_ref":"Job Create terraform plan #54 at https://github.com/presentium/infrastructure/actions/runs/10514305524","plan_out_hash":"12f98d751424366fded0bcff5da4298fbf1a463dfd3ee3ba859e9a5c4922b461","plan_hash":"30379cc11874df3ebf6d7ef86617e988172b4d80a4303b3d25d68d593754169e","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0] will be created
+   resource "aws_iam_policy" "ebs_csi" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to manage EBS volumes via the container storage interface driver"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "AmazonEKS_EBS_CSI_Policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:EnableFastSnapshotRestores",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/created-for/pvc/name" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               "kms:GrantIsForAWSResource" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:kms:eu-west-1:123247571664:key/5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
+                   {
+                       Action   = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:kms:eu-west-1:123247571664:key/5e8f9752-11b3-477b-87c3-4b8010b9b3ee"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0] will be created
+   resource "aws_iam_role_policy_attachment" "ebs_csi" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-EBS-CSI-PRESENTIUM"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply terraform plan #26](https://github.com/presentium/infrastructure/actions/runs/10514325313)
<details><summary>Outputs</summary>

```hcl
acm_certificate_arn   = "arn:aws:acm:eu-west-1:123247571664:certificate/c8f97f8a-0b2e-4df3-999f-cb803e96afa0"
eks_db_irsa_arns      = {
    api-prod    = "arn:aws:iam::123247571664:role/PRES-DB-API-PROD-PRESENTIUM"
    api-staging = "arn:aws:iam::123247571664:role/PRES-DB-API-STAGING-PRESENTIUM"
    authentik   = "arn:aws:iam::123247571664:role/PRES-DB-AUTHENTIK-PRESENTIUM"
}
eks_sops_kms_role_arn = "arn:aws:iam::123247571664:role/PRES-SOPS-KMS-PRESENTIUM"
iam_users             = {
    Christophe = "wcFMA9jYz27SnaN8AQ//ZT2pMcOraPFseG75f0xu6kVY6KLG/6fPzIBo49QLyZfbaA4RUQmzJ+UoUiptqfpTkH9AS6PPqAJuGFL20Zfa+3L0gKG7IJKkX81F6rAbtlA+WA5UW8BcQE/O5ANlsHv1H4wq8CnUS/q6NNjAqnEedDrcPWl1m6B197ajVHLl5ffqltVG4txXnCSzA3Htb44EW26eHp+PJgoicXGGmm/FQ/U6j9ScJlBnhM8mXVdwUpu43+ENo6gn6LUcC0Kd7WkSFBmMBjMdQVLDSUFzf0Ry6lwJvLIdab+N9ipcwJTgVQL4rrMZRXs7lhtg+aLw0TX7gVWNX0qwky/wc1i4vu/BP9giB4qJUEBsmdKyjlLiMk219zhTFyS5iGHzgx4qI8mFl+/qkIAAkO2nRIPL5E1alMeAjW0I9415yN8hq2qHYGnvJqVQHU7ZkgUkiHy4SVByla8vF+quZC88nZsFviP0DLTX174zUnWuyi3E//tjmiY01PTBzf7gHw7tGB1NrkbPnpBKvxM/UhnyLo4jG6iuiRA9EOApF1mn0pn9mDeCLHZQSyaGypZlpL7SsLvVL+0D+AKcXLOfoAxc/bqqp7U+yvFot4etrVQlfw8Rdic2FMsqwJcAwq64RZApvv49D34P27GowKfVNVv8qptxLAuukSfm8RgWLEVE4GOIz1Ec0H3SRQGk3U1SMudNCND5FqQwhoBWMWRH8sJnPnaI8x3HgPG7P8eJFAluwrER/CgylPqNDTWotJOdbYnTZ71JYTw86QKSN9ooAg=="
    Lea        = "wcFMA9jYz27SnaN8AQ//bU+rwTu+l2L+3NnqGmF2dPHNjJA793P/PNFlDX7GZggzWJqkhYW4cfqrSm7o1J1+T2XgkfWGVV+9BPAMmK+4rg5lVG6I03CXS+HLAJG2FkdYCdQZoJ7ZiN00F6TblWbBeX1pwVJ2UHMF9FdwCwsTvLDmHfpZnpl5nth6vF9rb1j9AE0X3RUjI9hVn6GAxIhINKUTcDQtUV4eE+rc3HnO6jk5UO1S+xQbkd3LNurePG+KaWeQXmRaaDpTajXrNXfp4qGbnsstBwZLzCLrtp6xt7IoMmr4HIhSlerXDQ3ktTH1SYLqecbNbvveqj0HHcjNoF7KtBSWs9iTZUsQ0gWCrka31Pm2GXLS96LwlJwGCVfpnDyAMy7uBPjQriywuXT8+zmu1EbzcxbhO8B2iohyRXLRjW0oZLtIX/8HNWNXGoK1IkhmAnnOQ9oN6YcgifkciD+n/eWXIEvOlPiiJl6ZmQ4tYJd4EtoSTZdlCk8olCIugW06bivKLoKWC0qabnLc4bB+imyxbGixqS9P0LrO/chQW7Q7dg4U5obN5vQ83xzP4hU3jk1J+Za9BW0uRTmUdEjZgIFh8dg7HjPNyh80+tVQEHgqHJwqXKCfoD+hQ9YKlgJcjng9PhxPlQ5xwHe03U1uRo7mCFceR3QEB5fYp0ICaUBpwu5tEFguw0lbI6HSRQGkDwHxDlY8fSoNl4oJQJK0bwvEZU+XF5gKdjpOi57BtPlBslGULyj42IXyTJ5Plp4/QcZtSeent6YE+BfcBSZxf793pQ=="
    Loic       = "wcFMA92wPHuZJ5FBAQ//Q770nuaNLqmnh2AweJDvGUjlvq8oQl8rNUmR9GMTtSNpygHinsozhkTQJt2kco1HopTRtL/Y6euHTm34IvDCz+Xru0X0HIwYluU6+bHmHtmoiGWBqSZeKl2Aw/GTQ3NQuYxCg80yrsdKuD9sG9MY1Zvw5LW+bmzTD2hEdXru3UdfHJRY8bzOddbS3One/yqzcQNNF8/Rhba78EneygxrtMgiNN02oKM2z2sxUehJE+z3/1sJqr2iRg2mSZJPb4KG7Vv2H+3/Nk6FD9NqGen0OIbBDxUb5VLm7GtBGeMe3Vc7zVHFiYAItNOV5LG61nWptVLfha4y4dJDcEznrAVOlzrZd7jUmuj8j/TVNWtCA8x6MwcAOlEdBHbx0lAZTNIPWy3RHQt5gYwbGjhngTY5m6lshi/p30v+qtfNFIAbOEdBg5SvqssmPIiKJqqil/A/lPbaTx25p6yCrfsv4WBjQtxbcKO2Q/Lj2Gm/O/jaWLxBnuNJh3IudbkpcPQyqpMCgRic6QhG81gTXDqfo759UAOiKW9NdUmnBWc/J8U29bJqOUZnR40ib4lJBh81Q9hP3A08l1ZwJfdANHPqez3MYLmddIY42s5tfShpbWwQwxtEgPb0zYYomSZ0pOZzH1iphnIG+VT8eDf1WLkg5GkyLmCgQ2iCvvNmCnzrq4g2y8bSRQHFq2kaL7TWy28VlRK5Fugbw2aR1yRqZ+s+2MzOVlObxwzJbp826Deou+sh9keglgp943f+MzKN9Cw8g4UTY058C3KhhQ=="
    Massimo    = "wcFMA9jYz27SnaN8AQ/8DD7S+UrqA/q1GjWnjineRn71eNBZOcWXvGvesSEh8iAEkG7grVkvLYdhNAl87G8UNBKSYzvnkqs4pKxfFE6Su8Vqf+FIeU4D6BuKaSFAfU4H210v0sc7zAWKecby/ZuM5GXKyeNezVz85MtUlvyhjpsq0TnHm/Mlw0iwx9IiM1tGM1mtC9fLzPiXVvIw0Jd3Wqv3wE76eYABkN81ptxZctBnrNi/D1htbwSq2jFvWjewFBtlADerO4jOTtbOwjVOThUf6dTc7ZoP1djRx+7ggOvxiWSGLwND0DMChcM6ustk8vjrTaZA3tWkLWSkJzCFQWEJQ4bbQfZQX5Mj9Fx6yRyI5R/Q/KhB2PSbZL8IamGWwN1tbgvfrJbIjamOGfW+Z+riTC54MZTPI2ycLY/nyVBKvGKtznowwizao1gjOnLu8KcDI+VukypA1tmQtnugXxaJ7GfaVN9A867caZP3WAJ0/Tor7yLAjrLD9USADN7NQmTWr5jcxhjkrsrLYGO34mh912RrtN1WsqtoCQ373tk7fW+Vg++myHp7zqSL0LfeY90iMHQxlTJRbnrkv0SKdbKvBmR2GReS7ngafWbjULRNbs8zUgui5jCMZ1Y/U6QEQagR99PKOYvL7+Gcc7Ki6cBD8Wrq+1aEtahvC02uWtJXKcy3QpJVEW/abYhTVW3SRQHCv7c5lzpVtM47lUv+R+Xg0PxwMTZ4iI/kutoDvc526jkeV3kpdBNYsRfkThCqfzZ20sqXj7bSATLKrpS/xQINvS0ZIQ=="
    Sacha      = "wcFMA9jYz27SnaN8AQ/9EfFcDhgMWgN76uCIYx2qxMOgAveb24I4Bq05Ipe0YZzpuXF8HH25a3E/w0wzTE8r8ev4Z2JnarRAesnq9XooitCWcC9ncxYPtBbcWlYDHf8TPTTOXyIRUFIw4y/5us7Jkrvu3TWB1vu0YrfB0H1XtOTYd7NN6GkImLDyPg8uIWqXseYHxYdiV+s+8mZlhJ3Z3tucNBoWwOEMQ/Yzwk2Nrvh1lYdCSCnMY4/c3Vv2QsU/qkLzX4L5w3ZEm/hmWIw8MI4/XJUyPXFk/Sl1VKXYUNobA6/LBeNWQCW+6e6sTYo1yeFG5A/qE0LpchmGtq7K/66t8APY2vJ7UZ1cpzd8KLPChicYaJIYC+Riaj6WdUGNOU+9GaZ8XZIbGhM7iLbJYutrOLStD/KkMDa6PIVkWF/7ohXmiZsDSuU1a1GO8nSTRhFwdaxiKLTXG4NiFEDo/sGE+DoabzkOVdx0zdm4UCQQ3jwnO9F2LJHTf6fQnN4WtLCaP2PN0DZo5dGtS7MOVl+O+gtF6dx1/DfJ95B96dvBfs2COJjAFZY8guXu7cIcz74JmM/CYkw8PFKB9guK2i4H4qSMk3dKYcKc6EId6Lduy1HEPC9Lje/qRaKdESBdi5xZ1Wo3GYGeHgQPfldr7XddBb973InbVCk6bKeXmwmDAWZtJx7K+hnrsA5FLfPSRQGF232XngZDXyd6PRk3bJdCib5DiJHMxYUPM0ZDAFlLr6aa7pOJiOt9nnHy+1cRXthml+la6b9UpZ6JjFR69HMR07NsVQ=="
}
```
</details>